plotMachineIOPS_LATENCY/fio_output/randwrite-32jobs-1024files-4k.fio_fuse_ext4.out
jobs1: (g=0): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=128
...
fio-3.28
Starting 32 processes
jobs1: Laying out IO files (1024 files / total 30720MiB)
fio: pid=1160074, err=24/file:filesetup.c:805, func=open(/tmp/ssfs/home/sevag/fuse_ext4/f1012), error=Too many open files

jobs1: (groupid=0, jobs=32): err=24 (file:filesetup.c:805, func=open(/tmp/ssfs/home/sevag/fuse_ext4/f1012), error=Too many open files): pid=1160074: Wed Jul 26 08:53:50 2023
  write: IOPS=2054, BW=8219KiB/s (8416kB/s)(4052KiB/493msec); 0 zone resets
    slat (usec): min=8, max=133495, avg=227.08, stdev=4547.99
    clat (usec): min=85, max=280736, avg=42150.16, stdev=47673.34
     lat (usec): min=97, max=280795, avg=42377.76, stdev=48191.07
    clat percentiles (msec):
     |  1.00th=[    6],  5.00th=[   18], 10.00th=[   23], 20.00th=[   27],
     | 30.00th=[   28], 40.00th=[   30], 50.00th=[   31], 60.00th=[   32],
     | 70.00th=[   33], 80.00th=[   39], 90.00th=[   46], 95.00th=[  142],
     | 99.00th=[  279], 99.50th=[  279], 99.90th=[  279], 99.95th=[  279],
     | 99.99th=[  279]
  lat (usec)   : 100=0.10%
  lat (msec)   : 2=0.20%, 4=0.49%, 10=1.38%, 20=4.24%, 50=83.91%
  lat (msec)   : 100=2.27%, 250=4.34%, 500=3.06%
  cpu          : usr=3.46%, sys=7.72%, ctx=1074, majf=0, minf=68
  IO depths    : 1=0.1%, 2=0.2%, 4=0.4%, 8=0.8%, 16=1.6%, 32=3.2%, >=64=93.8%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=99.9%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.1%
     issued rwts: total=0,1013,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=128

Run status group 0 (all jobs):
  WRITE: bw=8219KiB/s (8416kB/s), 8219KiB/s-8219KiB/s (8416kB/s-8416kB/s), io=4052KiB (4149kB), run=493-493msec