plotMachineIOPS_LATENCY/fio_output/randwrite-32jobs-1files-4k.fio_fuse_boc.out
jobs1: (g=0): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=128
...
fio-3.28
Starting 32 processes
jobs1: Laying out IO file (1 file / 30720MiB)

jobs1: (groupid=0, jobs=32): err= 0: pid=109516: Tue Jul 25 17:45:39 2023
  write: IOPS=178k, BW=694MiB/s (727MB/s)(30.0GiB/44293msec); 0 zone resets
    slat (nsec): min=1436, max=136226k, avg=4692.21, stdev=143298.32
    clat (nsec): min=1650, max=504846k, avg=711310.10, stdev=1884147.87
     lat (usec): min=4, max=504897, avg=716.09, stdev=1897.02
    clat percentiles (usec):
     |  1.00th=[  310],  5.00th=[  404], 10.00th=[  498], 20.00th=[  506],
     | 30.00th=[  515], 40.00th=[  523], 50.00th=[  537], 60.00th=[  611],
     | 70.00th=[  619], 80.00th=[  619], 90.00th=[  635], 95.00th=[  644],
     | 99.00th=[10683], 99.50th=[14353], 99.90th=[16450], 99.95th=[19006],
     | 99.99th=[21103]
   bw (  KiB/s): min=82410, max=973632, per=99.98%, avg=710056.19, stdev=102310.03, samples=88
   iops        : min=20604, max=243406, avg=177514.06, stdev=25577.47, samples=88
  lat (usec)   : 2=0.01%, 10=0.01%, 20=0.01%, 50=0.01%, 100=0.01%
  lat (usec)   : 250=0.01%, 500=13.01%, 750=84.93%, 1000=0.70%
  lat (msec)   : 2=0.22%, 4=0.01%, 10=0.06%, 20=1.04%, 50=0.03%
  lat (msec)   : 100=0.01%, 250=0.01%, 500=0.01%, 750=0.01%
  cpu          : usr=17.62%, sys=60.30%, ctx=753, majf=0, minf=72
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=100.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.1%
     issued rwts: total=0,7864320,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=128

Run status group 0 (all jobs):
  WRITE: bw=694MiB/s (727MB/s), 694MiB/s-694MiB/s (727MB/s-727MB/s), io=30.0GiB (32.2GB), run=44293-44293msec