plotMachineIOPS_LATENCY/fio_output/randwrite-32jobs-512files-32k.fio_tmpfs.out
jobs1: (g=0): rw=randwrite, bs=(R) 32.0KiB-32.0KiB, (W) 32.0KiB-32.0KiB, (T) 32.0KiB-32.0KiB, ioengine=libaio, iodepth=128
...
fio-3.28
Starting 32 processes
jobs1: Laying out IO files (512 files / total 30720MiB)

jobs1: (groupid=0, jobs=32): err= 0: pid=1112486: Wed Jul 26 06:12:00 2023
  write: IOPS=135k, BW=4206MiB/s (4411MB/s)(30.0GiB/7303msec); 0 zone resets
    slat (nsec): min=4951, max=35483, avg=6827.68, stdev=1905.48
    clat (nsec): min=1629, max=3213.2k, avg=943441.57, stdev=252670.21
     lat (usec): min=7, max=3230, avg=950.33, stdev=254.53
    clat percentiles (usec):
     |  1.00th=[  824],  5.00th=[  832], 10.00th=[  832], 20.00th=[  832],
     | 30.00th=[  840], 40.00th=[  840], 50.00th=[  840], 60.00th=[  848],
     | 70.00th=[  848], 80.00th=[  857], 90.00th=[ 1565], 95.00th=[ 1582],
     | 99.00th=[ 1598], 99.50th=[ 1598], 99.90th=[ 1614], 99.95th=[ 1942],
     | 99.99th=[ 2835]
   bw (  MiB/s): min= 2517, max= 4727, per=100.00%, avg=4207.63, stdev=922.31, samples=14
   iops        : min=80560, max=151270, avg=134644.21, stdev=29514.24, samples=14
  lat (usec)   : 2=0.01%, 10=0.01%, 20=0.01%, 50=0.01%, 100=0.01%
  lat (usec)   : 250=0.01%, 500=0.01%, 750=0.01%, 1000=85.47%
  lat (msec)   : 2=14.47%, 4=0.05%
  cpu          : usr=13.48%, sys=86.54%, ctx=7, majf=0, minf=60
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=100.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.1%
     issued rwts: total=0,983040,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=128

Run status group 0 (all jobs):
  WRITE: bw=4206MiB/s (4411MB/s), 4206MiB/s-4206MiB/s (4411MB/s-4411MB/s), io=30.0GiB (32.2GB), run=7303-7303msec