plotMachineIOPS_LATENCY/fio_output/read-16jobs-512files-32k.fio_ramdisk.out
jobs1: (g=0): rw=read, bs=(R) 32.0KiB-32.0KiB, (W) 32.0KiB-32.0KiB, (T) 32.0KiB-32.0KiB, ioengine=libaio, iodepth=128
...
fio-3.28
Starting 16 processes
jobs1: Laying out IO files (512 files / total 30720MiB)

jobs1: (groupid=0, jobs=16): err= 0: pid=1113666: Wed Jul 26 06:18:16 2023
  read: IOPS=181k, BW=5669MiB/s (5944MB/s)(30.0GiB/5419msec)
    slat (nsec): min=3777, max=63436, avg=5019.69, stdev=872.52
    clat (nsec): min=1322, max=6091.9k, avg=699907.87, stdev=111079.56
     lat (usec): min=5, max=6156, avg=704.96, stdev=111.83
    clat percentiles (usec):
     |  1.00th=[  635],  5.00th=[  635], 10.00th=[  635], 20.00th=[  644],
     | 30.00th=[  644], 40.00th=[  652], 50.00th=[  652], 60.00th=[  652],
     | 70.00th=[  660], 80.00th=[  824], 90.00th=[  873], 95.00th=[  881],
     | 99.00th=[  898], 99.50th=[  906], 99.90th=[ 1205], 99.95th=[ 1893],
     | 99.99th=[ 3458]
   bw (  MiB/s): min= 4379, max= 6134, per=99.33%, avg=5631.16, stdev=764.26, samples=10
   iops        : min=140148, max=196298, avg=180197.20, stdev=24456.47, samples=10
  lat (usec)   : 2=0.01%, 10=0.01%, 20=0.01%, 50=0.01%, 100=0.01%
  lat (usec)   : 250=0.01%, 500=0.01%, 750=76.72%, 1000=23.08%
  lat (msec)   : 2=0.14%, 4=0.04%, 10=0.01%
  cpu          : usr=9.95%, sys=90.00%, ctx=4, majf=0, minf=1069
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=100.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.1%
     issued rwts: total=983040,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=128

Run status group 0 (all jobs):
   READ: bw=5669MiB/s (5944MB/s), 5669MiB/s-5669MiB/s (5944MB/s-5944MB/s), io=30.0GiB (32.2GB), run=5419-5419msec