plotMachineIOPS_LATENCY/fio_output/read-16jobs-64files-4k.fio_tmpfs.out
jobs1: (g=0): rw=read, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=128
...
fio-3.28
Starting 16 processes
jobs1: Laying out IO files (64 files / total 30720MiB)

jobs1: (groupid=0, jobs=16): err= 0: pid=458642: Tue Jul 25 21:23:05 2023
  read: IOPS=620k, BW=2422MiB/s (2539MB/s)(30.0GiB/12685msec)
    slat (nsec): min=782, max=58798, avg=1181.68, stdev=493.16
    clat (nsec): min=1186, max=1535.1k, avg=205047.58, stdev=36354.34
     lat (usec): min=3, max=1563, avg=206.27, stdev=36.58
    clat percentiles (usec):
     |  1.00th=[  192],  5.00th=[  192], 10.00th=[  192], 20.00th=[  194],
     | 30.00th=[  194], 40.00th=[  194], 50.00th=[  196], 60.00th=[  196],
     | 70.00th=[  196], 80.00th=[  198], 90.00th=[  200], 95.00th=[  330],
     | 99.00th=[  338], 99.50th=[  338], 99.90th=[  351], 99.95th=[  515],
     | 99.99th=[  701]
   bw (  MiB/s): min= 1479, max= 2549, per=100.00%, avg=2437.16, stdev=308.44, samples=24
   iops        : min=378717, max=652670, avg=623914.00, stdev=78961.79, samples=24
  lat (usec)   : 2=0.01%, 4=0.01%, 10=0.01%, 20=0.01%, 50=0.01%
  lat (usec)   : 100=0.01%, 250=93.02%, 500=6.92%, 750=0.05%, 1000=0.01%
  lat (msec)   : 2=0.01%
  cpu          : usr=23.11%, sys=76.88%, ctx=29, majf=0, minf=166
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=100.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.1%
     issued rwts: total=7864320,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=128

Run status group 0 (all jobs):
   READ: bw=2422MiB/s (2539MB/s), 2422MiB/s-2422MiB/s (2539MB/s-2539MB/s), io=30.0GiB (32.2GB), run=12685-12685msec