plotMachineIOPS_LATENCY/fio_output/read-16jobs-64files-512k.fio_tmpfs.out
jobs1: (g=0): rw=read, bs=(R) 512KiB-512KiB, (W) 512KiB-512KiB, (T) 512KiB-512KiB, ioengine=libaio, iodepth=128
...
fio-3.28
Starting 16 processes
jobs1: Laying out IO files (64 files / total 30720MiB)

jobs1: (groupid=0, jobs=16): err= 0: pid=522529: Wed Jul 26 00:08:53 2023
  read: IOPS=8885, BW=4443MiB/s (4658MB/s)(30.0GiB/6915msec)
    slat (usec): min=97, max=740, avg=111.63, stdev=21.46
    clat (usec): min=2, max=55251, avg=14225.71, stdev=2086.66
     lat (usec): min=104, max=55994, avg=14337.46, stdev=2106.30
    clat percentiles (usec):
     |  1.00th=[13304],  5.00th=[13304], 10.00th=[13304], 20.00th=[13304],
     | 30.00th=[13304], 40.00th=[13304], 50.00th=[13304], 60.00th=[13304],
     | 70.00th=[13304], 80.00th=[13435], 90.00th=[17957], 95.00th=[17957],
     | 99.00th=[18220], 99.50th=[18744], 99.90th=[31851], 99.95th=[40633],
     | 99.99th=[52167]
   bw (  MiB/s): min= 3188, max= 4773, per=100.00%, avg=4446.62, stdev=588.68, samples=13
   iops        : min= 6377, max= 9547, avg=8893.15, stdev=1177.53, samples=13
  lat (usec)   : 4=0.01%, 250=0.01%, 500=0.01%, 750=0.01%, 1000=0.01%
  lat (msec)   : 2=0.02%, 4=0.03%, 10=0.09%, 20=99.64%, 50=0.19%
  lat (msec)   : 100=0.02%
  cpu          : usr=0.51%, sys=99.49%, ctx=11, majf=0, minf=16439
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=99.9%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.1%
     issued rwts: total=61440,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=128

Run status group 0 (all jobs):
   READ: bw=4443MiB/s (4658MB/s), 4443MiB/s-4443MiB/s (4658MB/s-4658MB/s), io=30.0GiB (32.2GB), run=6915-6915msec