plotMachineIOPS_LATENCY/fio_output/read-1jobs-1files-128k.fio_ramdisk.out
jobs1: (g=0): rw=read, bs=(R) 128KiB-128KiB, (W) 128KiB-128KiB, (T) 128KiB-128KiB, ioengine=libaio, iodepth=128
fio-3.28
Starting 1 process
jobs1: Laying out IO file (1 file / 30720MiB)

jobs1: (groupid=0, jobs=1): err= 0: pid=182523: Tue Jul 25 19:41:33 2023
  read: IOPS=56.5k, BW=7057MiB/s (7400MB/s)(30.0GiB/4353msec)
    slat (usec): min=13, max=207, avg=17.17, stdev= 4.03
    clat (nsec): min=1572, max=18524k, avg=2244191.39, stdev=416101.19
     lat (usec): min=16, max=18703, avg=2261.41, stdev=419.83
    clat percentiles (usec):
     |  1.00th=[ 2008],  5.00th=[ 2008], 10.00th=[ 2008], 20.00th=[ 2024],
     | 30.00th=[ 2024], 40.00th=[ 2024], 50.00th=[ 2024], 60.00th=[ 2040],
     | 70.00th=[ 2040], 80.00th=[ 2802], 90.00th=[ 2802], 95.00th=[ 2802],
     | 99.00th=[ 2835], 99.50th=[ 2835], 99.90th=[ 3654], 99.95th=[ 4817],
     | 99.99th=[15533]
   bw (  MiB/s): min= 5425, max= 7857, per=99.05%, avg=6990.25, stdev=1167.56, samples=8
   iops        : min=43406, max=62860, avg=55922.00, stdev=9340.45, samples=8
  lat (usec)   : 2=0.01%, 20=0.01%, 50=0.01%, 100=0.01%, 250=0.01%
  lat (usec)   : 500=0.01%, 750=0.01%, 1000=0.01%
  lat (msec)   : 2=0.36%, 4=99.53%, 10=0.06%, 20=0.03%
  cpu          : usr=3.75%, sys=96.21%, ctx=4, majf=0, minf=4110
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=100.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.1%
     issued rwts: total=245760,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=128

Run status group 0 (all jobs):
   READ: bw=7057MiB/s (7400MB/s), 7057MiB/s-7057MiB/s (7400MB/s-7400MB/s), io=30.0GiB (32.2GB), run=4353-4353msec